In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'maths' : [80, 89, 90, 20, 60],
    'science' : [40, 50, 90, 100, 50],
    'language' : [20, 30, 90, 95, 40]
})

In [3]:
df

   maths  science  language
0     80       40        20
1     89       50        30
2     90       90        90
3     20      100        95
4     60       50        40

In [4]:
df[df.index.isin([1, 2, 4])]

   maths  science  language
1     89       50        30
2     90       90        90
4     60       50        40